/*
SQLyog Ultimate v12.09 (32 bit)
MySQL - 10.1.10-MariaDB : Database - 2016kscm
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`2016kscm` /*!40100 DEFAULT CHARACTER SET utf8 */;

/*Table structure for table `users` */

DROP TABLE IF EXISTS `users`;

CREATE TABLE `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `报名ID` int(11) NOT NULL DEFAULT '0',
  `参赛队` varchar(100) NOT NULL DEFAULT '',
  `领队` varchar(100) NOT NULL DEFAULT '',
  `姓名` varchar(100) NOT NULL DEFAULT '',
  `性别` varchar(10) NOT NULL DEFAULT '',
  `编号` varchar(20) NOT NULL DEFAULT '',
  `组别` varchar(100) NOT NULL DEFAULT '',
  `号位` varchar(100) NOT NULL DEFAULT '',
  `分组` varchar(100) NOT NULL DEFAULT '',
  `组内序号` varchar(100) NOT NULL,
  `项目` varchar(100) NOT NULL DEFAULT '',
  `教练` varchar(100) NOT NULL DEFAULT '',
  `报名顺序` int(11) NOT NULL DEFAULT '0',
  `原始成绩` text NOT NULL,
  `成绩备注` text NOT NULL,
  `成绩显示` text NOT NULL,
  `最好成绩显示` varchar(255) NOT NULL DEFAULT '',
  `成绩排序` varchar(255) NOT NULL DEFAULT '',
  `排名` varchar(100) DEFAULT '',
  `奖项` varchar(100) NOT NULL DEFAULT '',
  `积分` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `编号` (`编号`),
  KEY `报名顺序` (`报名顺序`)
) ENGINE=MyISAM AUTO_INCREMENT=175 DEFAULT CHARSET=utf8;

/*Data for the table `users` */

insert  into `users`(`id`,`报名ID`,`参赛队`,`领队`,`姓名`,`性别`,`编号`,`组别`,`号位`,`分组`,`组内序号`,`项目`,`教练`,`报名顺序`,`原始成绩`,`成绩备注`,`成绩显示`,`最好成绩显示`,`成绩排序`,`排名`,`奖项`,`积分`) values (1,138,'昆山高新区新华舍幼儿园','','姚泽轩','','B1A001','幼儿园','','','','1/24电动遥控大脚车竞速赛','李嘉磊 王之逸',1,'','','','','','','',0),(2,139,'昆山高新区新华舍幼儿园','','金昊然','','B1A002','幼儿园','','','','1/24电动遥控大脚车竞速赛','李嘉磊 王之逸',1,'','','','','','','',0),(3,105,'昆山经济技术开发区蓬欣幼儿园','','卢俊嘉','','B1A003','幼儿园','','','','1/24电动遥控大脚车竞速赛','陆晓慧 周文燕',3,'','','','','','','',0),(4,106,'昆山经济技术开发区蓬欣幼儿园','','邹俊浩','','B1A004','幼儿园','','','','1/24电动遥控大脚车竞速赛','陆晓慧 周文燕',3,'','','','','','','',0),(5,107,'昆山经济技术开发区蓬欣幼儿园','','吴佳','','B1A005','幼儿园','','','','1/24电动遥控大脚车竞速赛','陆晓慧 周文燕',3,'','','','','','','',0),(6,154,'昆山开发区晨曦小学夏驾幼儿园','','陆顾鑫翰','','B1A006','幼儿园','','','','1/24电动遥控大脚车竞速赛','汤晓丹',6,'','','','','','','',0),(7,155,'昆山开发区晨曦小学夏驾幼儿园','','沈沛骐','','B1A007','幼儿园','','','','1/24电动遥控大脚车竞速赛','汤晓丹',6,'','','','','','','',0),(8,156,'昆山开发区晨曦小学夏驾幼儿园','','束致远','','B1A008','幼儿园','','','','1/24电动遥控大脚车竞速赛','汤晓丹',6,'','','','','','','',0),(9,55,'昆山市柏庐幼儿园','','戴俊良','','B1A009','幼儿园','','','','1/24电动遥控大脚车竞速赛','张舒蓉',9,'','','','','','','',0),(10,56,'昆山市柏庐幼儿园','','吴俊霆','','B1A010','幼儿园','','','','1/24电动遥控大脚车竞速赛','张舒蓉',9,'','','','','','','',0),(11,57,'昆山市柏庐幼儿园','','王梓旭','','B1A011','幼儿园','','','','1/24电动遥控大脚车竞速赛','张舒蓉',9,'','','','','','','',0),(12,25,'昆山市城北富士康幼儿园','','张子骞','','B1A012','幼儿园','','','','1/24电动遥控大脚车竞速赛','张映辉 吴英雅',12,'','','','','','','',0),(13,26,'昆山市城北富士康幼儿园','','赵翊天','','B1A013','幼儿园','','','','1/24电动遥控大脚车竞速赛','张映辉 吴英雅',12,'','','','','','','',0),(14,27,'昆山市城北富士康幼儿园','','陈钰豪','','B1A014','幼儿园','','','','1/24电动遥控大脚车竞速赛','张映辉 吴英雅',12,'','','','','','','',0),(15,114,'昆山市红峰幼儿园','','王顾瑞','','B1A015','幼儿园','','','','1/24电动遥控大脚车竞速赛','冯岚',15,'','','','','','','',0),(16,115,'昆山市红峰幼儿园','','端昊阳','','B1A016','幼儿园','','','','1/24电动遥控大脚车竞速赛','冯岚',15,'','','','','','','',0),(17,116,'昆山市红峰幼儿园','','邸梓航','','B1A017','幼儿园','','','','1/24电动遥控大脚车竞速赛','冯岚',15,'','','','','','','',0),(18,140,'昆山市机关幼儿园','','范韫铭','','B1A018','幼儿园','','','','1/24电动遥控大脚车竞速赛','金立萍',18,'','','','','','','',0),(19,146,'昆山市机关幼儿园','','李钇衡','','B1A019','幼儿园','','','','1/24电动遥控大脚车竞速赛','金立萍',18,'','','','','','','',0),(20,142,'昆山市机关幼儿园','','柳岳铉','','B1A020','幼儿园','','','','1/24电动遥控大脚车竞速赛','金立萍',18,'','','','','','','',0),(21,96,'昆山市陆家好孩子幼儿园','','陈冯睿','','B1A021','幼儿园','','','','1/24电动遥控大脚车竞速赛','曹远芳',21,'','','','','','','',0),(22,97,'昆山市陆家好孩子幼儿园','','李瑾瑜','','B1A022','幼儿园','','','','1/24电动遥控大脚车竞速赛','曹远芳',21,'','','','','','','',0),(23,98,'昆山市陆家好孩子幼儿园','','戴钟轩','','B1A023','幼儿园','','','','1/24电动遥控大脚车竞速赛','曹远芳',21,'','','','','','','',0),(24,58,'昆山市蓬朗中心小学校幼儿园','','吴彦南','','B1A024','幼儿园','','','','1/24电动遥控大脚车竞速赛','袁方菱',24,'','','','','','','',0),(25,61,'昆山市蓬朗中心小学校幼儿园','','陆奕君','','B1A025','幼儿园','','','','1/24电动遥控大脚车竞速赛','袁方菱',24,'','','','','','','',0),(26,60,'昆山市蓬朗中心小学校幼儿园','','刘晔齐','','B1A026','幼儿园','','','','1/24电动遥控大脚车竞速赛','袁方菱',24,'','','','','','','',0),(27,174,'昆山市实验幼儿园','','周泽坤','','B1A027','幼儿园','','','','1/24电动遥控大脚车竞速赛','杨晓燕',27,'','','','','','','',0),(28,175,'昆山市实验幼儿园','','方懿轩','','B1A028','幼儿园','','','','1/24电动遥控大脚车竞速赛','杨晓燕',27,'','','','','','','',0),(29,176,'昆山市实验幼儿园','','倪鸿铭','','B1A029','幼儿园','','','','1/24电动遥控大脚车竞速赛','杨晓燕',27,'','','','','','','',0),(30,150,'昆山市实验幼儿园金谷园分园','','金柯羽','','B1A030','幼儿园','','','','1/24电动遥控大脚车竞速赛','张琰',30,'','','','','','','',0),(31,147,'昆山市实验幼儿园澞河苑分园','','王瑜琦','','B1A031','幼儿园','','','','1/24电动遥控大脚车竞速赛','王莉 储雨婷',31,'','','','','','','',0),(32,148,'昆山市实验幼儿园澞河苑分园','','王睿清','','B1A032','幼儿园','','','','1/24电动遥控大脚车竞速赛','王莉 储雨婷',31,'','','','','','','',0),(33,80,'昆山市西湾幼儿园','','徐煜轩','','B1A033','幼儿园','','','','1/24电动遥控大脚车竞速赛','章若敏',33,'','','','','','','',0),(34,81,'昆山市西湾幼儿园','','郑浩哲','','B1A034','幼儿园','','','','1/24电动遥控大脚车竞速赛','章若敏',33,'','','','','','','',0),(35,82,'昆山市西湾幼儿园','','瞿殷昊','','B1A035','幼儿园','','','','1/24电动遥控大脚车竞速赛','章若敏',33,'','','','','','','',0),(36,10,'昆山市西湾幼儿园富华分园','','马金一','','B1A036','幼儿园','','','','1/24电动遥控大脚车竞速赛','刘婷婷',36,'','','','','','','',0),(37,12,'昆山市西湾幼儿园富华分园','','王睿涵','','B1A037','幼儿园','','','','1/24电动遥控大脚车竞速赛','刘婷婷',36,'','','','','','','',0),(38,14,'昆山市西湾幼儿园富华分园','','唐唯心','','B1A038','幼儿园','','','','1/24电动遥控大脚车竞速赛','刘婷婷',36,'','','','','','','',0),(39,123,'昆山市绣衣幼儿园','','孔昀晨','','B1A039','幼儿园','','','','1/24电动遥控大脚车竞速赛','张优芳',39,'','','','','','','',0),(40,124,'昆山市绣衣幼儿园','','顾齐力','','B1A040','幼儿园','','','','1/24电动遥控大脚车竞速赛','张优芳',39,'','','','','','','',0),(41,128,'昆山市绣衣幼儿园','','乐宇晨','','B1A041','幼儿园','','','','1/24电动遥控大脚车竞速赛','张优芳',39,'','','','','','','',0),(42,136,'昆山市玉山镇北珊湾幼儿园','','管俊棠','','B1A042','幼儿园','','','','1/24电动遥控大脚车竞速赛','马骋 宋晓艳 王梦君 冯小雨 陈国琴',42,'','','','','','','',0),(43,166,'昆山市玉山镇北珊湾幼儿园','','高梓涵','','B1A043','幼儿园','','','','1/24电动遥控大脚车竞速赛','马骋 宋晓艳 王梦君 冯小雨 陈国琴',42,'','','','','','','',0),(44,167,'昆山市玉山镇北珊湾幼儿园','','徐梓恒','','B1A044','幼儿园','','','','1/24电动遥控大脚车竞速赛','马骋 宋晓艳 王梦君 冯小雨 陈国琴',42,'','','','','','','',0),(45,102,'昆山经济技术开发区蓬欣幼儿园','','朱俊宇','','B2A001','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','陆晓慧 周文燕',3,'','','','','','','',0),(46,103,'昆山经济技术开发区蓬欣幼儿园','','窦子涵','','B2A002','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','陆晓慧 周文燕',3,'','','','','','','',0),(47,104,'昆山经济技术开发区蓬欣幼儿园','','蔡君昊','','B2A003','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','陆晓慧 周文燕',3,'','','','','','','',0),(48,157,'昆山开发区晨曦小学夏驾幼儿园','','彭博涛','','B2A004','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','汤晓丹',6,'','','','','','','',0),(49,158,'昆山开发区晨曦小学夏驾幼儿园','','任奕飞','','B2A005','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','汤晓丹',6,'','','','','','','',0),(50,159,'昆山开发区晨曦小学夏驾幼儿园','','宣开明','','B2A006','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','汤晓丹',6,'','','','','','','',0),(51,52,'昆山市柏庐幼儿园','','戴玮辰','','B2A007','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','叶  静',9,'','','','','','','',0),(52,53,'昆山市柏庐幼儿园','','徐智晖','','B2A008','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','叶  静',9,'','','','','','','',0),(53,54,'昆山市柏庐幼儿园','','付瑞禹','','B2A009','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','叶  静',9,'','','','','','','',0),(54,22,'昆山市城北富士康幼儿园','','肖虹宇','','B2A010','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','张映辉 吴英雅',12,'','','','','','','',0),(55,23,'昆山市城北富士康幼儿园','','陆田牧','','B2A011','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','张映辉 吴英雅',12,'','','','','','','',0),(56,24,'昆山市城北富士康幼儿园','','李子琪','','B2A012','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','张映辉 吴英雅',12,'','','','','','','',0),(57,117,'昆山市红峰幼儿园','','何雨辰','','B2A013','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','俞晓燕',15,'','','','','','','',0),(58,118,'昆山市红峰幼儿园','','徐琰葳','','B2A014','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','俞晓燕',15,'','','','','','','',0),(59,119,'昆山市红峰幼儿园','','王嘉煦','','B2A015','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','俞晓燕',15,'','','','','','','',0),(60,99,'昆山市陆家好孩子幼儿园','','胡天阔','','B2A016','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','沈霞芬',21,'','','','','','','',0),(61,100,'昆山市陆家好孩子幼儿园','','闫钰恒','','B2A017','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','沈霞芬',21,'','','','','','','',0),(62,101,'昆山市陆家好孩子幼儿园','','张景俊','','B2A018','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','沈霞芬',21,'','','','','','','',0),(63,62,'昆山市蓬朗中心小学校幼儿园','','王锦程','','B2A019','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','马龙超',24,'','','','','','','',0),(64,63,'昆山市蓬朗中心小学校幼儿园','','周宇尘','','B2A020','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','马龙超',24,'','','','','','','',0),(65,64,'昆山市蓬朗中心小学校幼儿园','','董梓聪','','B2A021','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','马龙超',24,'','','','','','','',0),(66,171,'昆山市实验幼儿园','','徐闵骏','','B2A022','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','高玉蓉',27,'','','','','','','',0),(67,172,'昆山市实验幼儿园','','程睦然','','B2A023','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','高玉蓉',27,'','','','','','','',0),(68,173,'昆山市实验幼儿园','','胡梓涵','','B2A024','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','高玉蓉',27,'','','','','','','',0),(69,83,'昆山市西湾幼儿园','','王立宸','','B2A025','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','沈超',33,'','','','','','','',0),(70,84,'昆山市西湾幼儿园','','韩林峰','','B2A026','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','沈超',33,'','','','','','','',0),(71,85,'昆山市西湾幼儿园','','钟涵宇','','B2A027','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','沈超',33,'','','','','','','',0),(72,11,'昆山市西湾幼儿园富华分园','','刘珊彤','','B2A028','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','马丽雯',36,'','','','','','','',0),(73,13,'昆山市西湾幼儿园富华分园','','李正浩','','B2A029','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','马丽雯',36,'','','','','','','',0),(74,15,'昆山市西湾幼儿园富华分园','','俞子越','','B2A030','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','马丽雯',36,'','','','','','','',0),(75,125,'昆山市绣衣幼儿园','','陈子豪','','B2A031','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','高贝贝',39,'','','','','','','',0),(76,126,'昆山市绣衣幼儿园','','战一凡','','B2A032','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','高贝贝',39,'','','','','','','',0),(77,127,'昆山市绣衣幼儿园','','刘亦洲','','B2A033','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','高贝贝',39,'','','','','','','',0),(78,168,'昆山市玉山镇北珊湾幼儿园','','钱思尧','','B2A034','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','马骋 张蕾 徐敏 冯小雨 金诺',42,'','','','','','','',0),(79,169,'昆山市玉山镇北珊湾幼儿园','','沈墨言','','B2A035','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','马骋 张蕾 徐敏 冯小雨 金诺',42,'','','','','','','',0),(80,170,'昆山市玉山镇北珊湾幼儿园','','朴宇洋','','B2A036','幼儿园','','','','双钻2·4G教育赛车遥控竞速赛','马骋 张蕾 徐敏 冯小雨 金诺',42,'','','','','','','',0),(81,129,'昆山淀山湖中心小学校花园幼儿园','','沈高乐馨','','A1A047','幼儿园','','','','智力七巧板现场拼搭个人赛','王超 张俊杰',81,'','','','','','','',0),(82,130,'昆山淀山湖中心小学校花园幼儿园','','顾怡辉','','A1A048','幼儿园','','','','智力七巧板现场拼搭个人赛','王超 张俊杰',81,'','','','','','','',0),(83,131,'昆山淀山湖中心小学校花园幼儿园','','杨心爱','','A1A049','幼儿园','','','','智力七巧板现场拼搭个人赛','王超 张俊杰',81,'','','','','','','',0),(84,31,'昆山高新区翰林幼儿园','','沈俊杨','','A1A050','幼儿园','','','','智力七巧板现场拼搭个人赛','徐夏平',84,'','','','','','','',0),(85,32,'昆山高新区翰林幼儿园','','王之迈','','A1A051','幼儿园','','','','智力七巧板现场拼搭个人赛','徐夏平',84,'','','','','','','',0),(86,33,'昆山高新区翰林幼儿园','','罗紫瑜','','A1A052','幼儿园','','','','智力七巧板现场拼搭个人赛','徐夏平',84,'','','','','','','',0),(87,1,'昆山高新区南星渎幼儿园','','陈宇轩','','A1A053','幼儿园','','','','智力七巧板现场拼搭个人赛','牛方颖 高韵佳',87,'','','','','','','',0),(88,2,'昆山高新区南星渎幼儿园','','陈子阳','','A1A054','幼儿园','','','','智力七巧板现场拼搭个人赛','牛方颖 高韵佳',87,'','','','','','','',0),(89,3,'昆山高新区南星渎幼儿园','','薛景晖','','A1A055','幼儿园','','','','智力七巧板现场拼搭个人赛','牛方颖 高韵佳',87,'','','','','','','',0),(90,177,'昆山高新区前进幼儿园','','孙懿煊','','A1A056','幼儿园','','','','智力七巧板现场拼搭个人赛','陆贞珍',90,'','','','','','','',0),(91,178,'昆山高新区前进幼儿园','','王子轩','','A1A057','幼儿园','','','','智力七巧板现场拼搭个人赛','陆贞珍',90,'','','','','','','',0),(92,179,'昆山高新区前进幼儿园','','车畅','','A1A058','幼儿园','','','','智力七巧板现场拼搭个人赛','陆贞珍',90,'','','','','','','',0),(93,137,'昆山高新区新华舍幼儿园','','李世博','','A1A001','幼儿园','','','','智力七巧板现场拼搭个人赛','倪雅倩',1,'','','','','','','',0),(94,163,'昆山高新区新华舍幼儿园','','赵宇轩','','A1A002','幼儿园','','','','智力七巧板现场拼搭个人赛','倪雅倩',1,'','','','','','','',0),(95,164,'昆山高新区新华舍幼儿园','','丁建伟','','A1A003','幼儿园','','','','智力七巧板现场拼搭个人赛','倪雅倩',1,'','','','','','','',0),(96,68,'昆山花桥曹安幼儿园','','顾倍源','','A1A059','幼儿园','','','','智力七巧板现场拼搭个人赛','罗潇琦',96,'','','','','','','',0),(97,69,'昆山花桥曹安幼儿园','','张天乐','','A1A060','幼儿园','','','','智力七巧板现场拼搭个人赛','罗潇琦',96,'','','','','','','',0),(98,70,'昆山花桥曹安幼儿园','','王晟毅','','A1A061','幼儿园','','','','智力七巧板现场拼搭个人赛','罗潇琦',96,'','','','','','','',0),(99,87,'昆山经济技术开发区蓬欣幼儿园','','窦子涵','','A1A004','幼儿园','','','','智力七巧板现场拼搭个人赛','李静 赵雪琴',3,'','','','','','','',0),(100,88,'昆山经济技术开发区蓬欣幼儿园','','蔡君昊','','A1A005','幼儿园','','','','智力七巧板现场拼搭个人赛','李静 赵雪琴',3,'','','','','','','',0),(101,89,'昆山经济技术开发区蓬欣幼儿园','','周嘉','','A1A006','幼儿园','','','','智力七巧板现场拼搭个人赛','李静 赵雪琴',3,'','','','','','','',0),(102,34,'昆山开发区晨曦小学夏驾幼儿园','','刘兰溪','','A1A007','幼儿园','','','','智力七巧板现场拼搭个人赛','沈静',6,'','','','','','','',0),(103,35,'昆山开发区晨曦小学夏驾幼儿园','','谢东辰','','A1A008','幼儿园','','','','智力七巧板现场拼搭个人赛','沈静',6,'','','','','','','',0),(104,36,'昆山开发区晨曦小学夏驾幼儿园','','何锦明','','A1A009','幼儿园','','','','智力七巧板现场拼搭个人赛','沈静',6,'','','','','','','',0),(105,49,'昆山市柏庐幼儿园','','郁曹峻','','A1A010','幼儿园','','','','智力七巧板现场拼搭个人赛','吴怡星',9,'','','','','','','',0),(106,50,'昆山市柏庐幼儿园','','蔡张承','','A1A011','幼儿园','','','','智力七巧板现场拼搭个人赛','吴怡星',9,'','','','','','','',0),(107,51,'昆山市柏庐幼儿园','','王怿宇','','A1A012','幼儿园','','','','智力七巧板现场拼搭个人赛','吴怡星',9,'','','','','','','',0),(108,19,'昆山市城北富士康幼儿园','','张洪瑞','','A1A013','幼儿园','','','','智力七巧板现场拼搭个人赛','陈丽霞 金依',12,'','','','','','','',0),(109,20,'昆山市城北富士康幼儿园','','朱彦阳','','A1A014','幼儿园','','','','智力七巧板现场拼搭个人赛','陈丽霞 金依',12,'','','','','','','',0),(110,21,'昆山市城北富士康幼儿园','','洪子宸','','A1A015','幼儿园','','','','智力七巧板现场拼搭个人赛','陈丽霞 金依',12,'','','','','','','',0),(111,151,'昆山市城北中心小学校幼儿园','','孙优诺','','A1A062','幼儿园','','','','智力七巧板现场拼搭个人赛','朱怡',111,'','','','','','','',0),(112,152,'昆山市城北中心小学校幼儿园','','庄景程','','A1A063','幼儿园','','','','智力七巧板现场拼搭个人赛','朱怡',111,'','','','','','','',0),(113,153,'昆山市城北中心小学校幼儿园','','闵浩轩','','A1A064','幼儿园','','','','智力七巧板现场拼搭个人赛','朱怡',111,'','','','','','','',0),(114,132,'昆山市淀山湖中心小学校幼儿园','','邱梓欣','','A1A065','幼儿园','','','','智力七巧板现场拼搭个人赛','虞天枭 谢浩',114,'','','','','','','',0),(115,133,'昆山市淀山湖中心小学校幼儿园','','王天依','','A1A066','幼儿园','','','','智力七巧板现场拼搭个人赛','虞天枭 谢浩',114,'','','','','','','',0),(116,134,'昆山市淀山湖中心小学校幼儿园','','谢中杰','','A1A067','幼儿园','','','','智力七巧板现场拼搭个人赛','虞天枭 谢浩',114,'','','','','','','',0),(117,111,'昆山市红峰幼儿园','','宋卉妍','','A1A016','幼儿园','','','','智力七巧板现场拼搭个人赛','刘诗云',15,'','','','','','','',0),(118,112,'昆山市红峰幼儿园','','翁楚轩','','A1A017','幼儿园','','','','智力七巧板现场拼搭个人赛','刘诗云',15,'','','','','','','',0),(119,113,'昆山市红峰幼儿园','','陆芦恒','','A1A018','幼儿园','','','','智力七巧板现场拼搭个人赛','刘诗云',15,'','','','','','','',0),(120,43,'昆山市花桥中心小学校幼儿园','','季哲楷','','A1A068','幼儿园','','','','智力七巧板现场拼搭个人赛','叶丽雅',120,'','','','','','','',0),(121,44,'昆山市花桥中心小学校幼儿园','','黄陈雅','','A1A069','幼儿园','','','','智力七巧板现场拼搭个人赛','叶丽雅',120,'','','','','','','',0),(122,45,'昆山市花桥中心小学校幼儿园','','黄成智','','A1A070','幼儿园','','','','智力七巧板现场拼搭个人赛','叶丽雅',120,'','','','','','','',0),(123,143,'昆山市机关幼儿园','','姚禹行','','A1A019','幼儿园','','','','智力七巧板现场拼搭个人赛','金立萍  张雷',18,'','','','','','','',0),(124,144,'昆山市机关幼儿园','','顾晨乙','','A1A020','幼儿园','','','','智力七巧板现场拼搭个人赛','金立萍  张雷',18,'','','','','','','',0),(125,145,'昆山市机关幼儿园','','周子钦','','A1A021','幼儿园','','','','智力七巧板现场拼搭个人赛','金立萍  张雷',18,'','','','','','','',0),(126,40,'昆山市锦华幼儿园','','郭奕涵','','A1A071','幼儿园','','','','智力七巧板现场拼搭个人赛','薛琴',126,'','','','','','','',0),(127,41,'昆山市锦华幼儿园','','姜文','','A1A072','幼儿园','','','','智力七巧板现场拼搭个人赛','薛琴',126,'','','','','','','',0),(128,42,'昆山市锦华幼儿园','','张楷峦','','A1A073','幼儿园','','','','智力七巧板现场拼搭个人赛','薛琴',126,'','','','','','','',0),(129,93,'昆山市陆家好孩子幼儿园','','田雨锟','','A1A022','幼儿园','','','','智力七巧板现场拼搭个人赛','王晓敏',21,'','','','','','','',0),(130,94,'昆山市陆家好孩子幼儿园','','戴黄嫣','','A1A023','幼儿园','','','','智力七巧板现场拼搭个人赛','王晓敏',21,'','','','','','','',0),(131,95,'昆山市陆家好孩子幼儿园','','袁安杰','','A1A024','幼儿园','','','','智力七巧板现场拼搭个人赛','王晓敏',21,'','','','','','','',0),(132,28,'昆山市蓬朗中心小学校幼儿园','','曹润喆','','A1A025','幼儿园','','','','智力七巧板现场拼搭个人赛','唐建芬 龚晓敏',24,'','','','','','','',0),(133,29,'昆山市蓬朗中心小学校幼儿园','','毕峻熙','','A1A026','幼儿园','','','','智力七巧板现场拼搭个人赛','唐建芬 龚晓敏',24,'','','','','','','',0),(134,30,'昆山市蓬朗中心小学校幼儿园','','周时成','','A1A027','幼儿园','','','','智力七巧板现场拼搭个人赛','唐建芬 龚晓敏',24,'','','','','','','',0),(135,108,'昆山市千灯镇淞南幼儿园','','雍洲','','A1A074','幼儿园','','','','智力七巧板现场拼搭个人赛','金祎',135,'','','','','','','',0),(136,109,'昆山市千灯镇淞南幼儿园','','付肇鑫','','A1A075','幼儿园','','','','智力七巧板现场拼搭个人赛','金祎',135,'','','','','','','',0),(137,110,'昆山市千灯镇淞南幼儿园','','邵建辉','','A1A076','幼儿园','','','','智力七巧板现场拼搭个人赛','金祎',135,'','','','','','','',0),(138,46,'昆山市仁宝幼儿园','','程昕瑞','','A1A077','幼儿园','','','','智力七巧板现场拼搭个人赛','唐春芳  宋杨岚',138,'','','','','','','',0),(139,47,'昆山市仁宝幼儿园','','卞思涵','','A1A078','幼儿园','','','','智力七巧板现场拼搭个人赛','唐春芳  宋杨岚',138,'','','','','','','',0),(140,48,'昆山市仁宝幼儿园','','蔡雨萌','','A1A079','幼儿园','','','','智力七巧板现场拼搭个人赛','唐春芳  宋杨岚',138,'','','','','','','',0),(141,4,'昆山市实验幼儿园','','顾晨曦','','A1A028','幼儿园','','','','智力七巧板现场拼搭个人赛','陆雯琳',27,'','','','','','','',0),(142,5,'昆山市实验幼儿园','','管晋永','','A1A029','幼儿园','','','','智力七巧板现场拼搭个人赛','陆雯琳',27,'','','','','','','',0),(143,6,'昆山市实验幼儿园','','张璐','','A1A030','幼儿园','','','','智力七巧板现场拼搭个人赛','陆雯琳',27,'','','','','','','',0),(144,149,'昆山市实验幼儿园金谷园分园','','耿灵熙','','A1A031','幼儿园','','','','智力七巧板现场拼搭个人赛','倪娟',30,'','','','','','','',0),(145,37,'昆山市实验幼儿园澞河苑分园','','程浩洋','','A1A032','幼儿园','','','','智力七巧板现场拼搭个人赛','陆琴芳 王莉',31,'','','','','','','',0),(146,38,'昆山市实验幼儿园澞河苑分园','','顾雯心','','A1A033','幼儿园','','','','智力七巧板现场拼搭个人赛','陆琴芳 王莉',31,'','','','','','','',0),(147,39,'昆山市实验幼儿园澞河苑分园','','王佳思','','A1A034','幼儿园','','','','智力七巧板现场拼搭个人赛','陆琴芳 王莉',31,'','','','','','','',0),(148,77,'昆山市西湾幼儿园','','周义然','','A1A035','幼儿园','','','','智力七巧板现场拼搭个人赛','张永芬 张淑蓉',33,'','','','','','','',0),(149,79,'昆山市西湾幼儿园','','姬刘荣','','A1A036','幼儿园','','','','智力七巧板现场拼搭个人赛','张永芬 张淑蓉',33,'','','','','','','',0),(150,86,'昆山市西湾幼儿园','','胡敬哲','','A1A037','幼儿园','','','','智力七巧板现场拼搭个人赛','张永芬 张淑蓉',33,'','','','','','','',0),(151,7,'昆山市西湾幼儿园富华分园','','李可唯','','A1A038','幼儿园','','','','智力七巧板现场拼搭个人赛','左静芝',36,'','','','','','','',0),(152,8,'昆山市西湾幼儿园富华分园','','赵思蔚','','A1A039','幼儿园','','','','智力七巧板现场拼搭个人赛','左静芝',36,'','','','','','','',0),(153,9,'昆山市西湾幼儿园富华分园','','刘子晗','','A1A040','幼儿园','','','','智力七巧板现场拼搭个人赛','左静芝',36,'','','','','','','',0),(154,120,'昆山市绣衣幼儿园','','徐欣彤','','A1A041','幼儿园','','','','智力七巧板现场拼搭个人赛','居秋霞',39,'','','','','','','',0),(155,121,'昆山市绣衣幼儿园','','洪心琪','','A1A042','幼儿园','','','','智力七巧板现场拼搭个人赛','居秋霞',39,'','','','','','','',0),(156,122,'昆山市绣衣幼儿园','','漆迪','','A1A043','幼儿园','','','','智力七巧板现场拼搭个人赛','居秋霞',39,'','','','','','','',0),(157,135,'昆山市玉山镇北珊湾幼儿园','','张艺琳','','A1A044','幼儿园','','','','智力七巧板现场拼搭个人赛','马骋 宋晓艳 陈国琴 丰毓茜 王梦君',42,'','','','','','','',0),(158,76,'昆山市玉山镇北珊湾幼儿园','','李瑞桐','','A1A045','幼儿园','','','','智力七巧板现场拼搭个人赛','马骋 宋晓艳 陈国琴 丰毓茜 王梦君',42,'','','','','','','',0),(159,165,'昆山市玉山镇北珊湾幼儿园','','任雨泽','','A1A046','幼儿园','','','','智力七巧板现场拼搭个人赛','马骋 宋晓艳 陈国琴 丰毓茜 王梦君',42,'','','','','','','',0),(160,90,'昆山市张浦镇第二幼儿园','','张凯文','','A1A080','幼儿园','','','','智力七巧板现场拼搭个人赛','陈瑛',160,'','','','','','','',0),(161,91,'昆山市张浦镇第二幼儿园','','朱晨曦','','A1A081','幼儿园','','','','智力七巧板现场拼搭个人赛','陈瑛',160,'','','','','','','',0),(162,92,'昆山市张浦镇第二幼儿园','','刘欣蕾','','A1A082','幼儿园','','','','智力七巧板现场拼搭个人赛','陈瑛',160,'','','','','','','',0),(163,160,'昆山市张浦镇周巷幼儿园','','李瑾萱','','A1A083','幼儿园','','','','智力七巧板现场拼搭个人赛','王晓艳',163,'','','','','','','',0),(164,161,'昆山市张浦镇周巷幼儿园','','齐子诺','','A1A084','幼儿园','','','','智力七巧板现场拼搭个人赛','王晓艳',163,'','','','','','','',0),(165,162,'昆山市张浦镇周巷幼儿园','','潘鸿宇','','A1A085','幼儿园','','','','智力七巧板现场拼搭个人赛','王晓艳',163,'','','','','','','',0),(166,16,'昆山市正仪中心小学附属幼儿园','','王一茜','','A1A086','幼儿园','','','','智力七巧板现场拼搭个人赛','唐晓青',166,'','','','','','','',0),(167,17,'昆山市正仪中心小学附属幼儿园','','高福栋','','A1A087','幼儿园','','','','智力七巧板现场拼搭个人赛','唐晓青',166,'','','','','','','',0),(168,18,'昆山市正仪中心小学附属幼儿园','','谢语晨','','A1A088','幼儿园','','','','智力七巧板现场拼搭个人赛','唐晓青',166,'','','','','','','',0),(169,65,'昆山市周庄中心幼儿园','','许鑫博','','A1A089','幼儿园','','','','智力七巧板现场拼搭个人赛','陆燕芳',169,'','','','','','','',0),(170,66,'昆山市周庄中心幼儿园','','王晨霏','','A1A090','幼儿园','','','','智力七巧板现场拼搭个人赛','陆燕芳',169,'','','','','','','',0),(171,67,'昆山市周庄中心幼儿园','','李明浩','','A1A091','幼儿园','','','','智力七巧板现场拼搭个人赛','陆燕芳',169,'','','','','','','',0),(172,71,'昆山市周庄中心幼儿园新镇区分园','','郭济','','A1A092','幼儿园','','','','智力七巧板现场拼搭个人赛','陈潇芸',172,'','','','','','','',0),(173,72,'昆山市周庄中心幼儿园新镇区分园','','张晨熙','','A1A093','幼儿园','','','','智力七巧板现场拼搭个人赛','陈潇芸',172,'','','','','','','',0),(174,73,'昆山市周庄中心幼儿园新镇区分园','','费奕萱','','A1A094','幼儿园','','','','智力七巧板现场拼搭个人赛','陈潇芸',172,'','','','','','','',0);

/*Table structure for table `a1中学“七彩风车小屋”拼装彩绘个人赛` */

DROP TABLE IF EXISTS `a1中学“七彩风车小屋”拼装彩绘个人赛`;

/*!50001 DROP VIEW IF EXISTS `a1中学“七彩风车小屋”拼装彩绘个人赛` */;
/*!50001 DROP TABLE IF EXISTS `a1中学“七彩风车小屋”拼装彩绘个人赛` */;

/*!50001 CREATE TABLE  `a1中学“七彩风车小屋”拼装彩绘个人赛`(
 `id` int(11) ,
 `参赛队` varchar(100) ,
 `姓名` varchar(100) ,
 `编号` varchar(20) ,
 `原始成绩` text ,
 `成绩备注` text ,
 `成绩排序` varchar(255) ,
 `排名` varchar(100) ,
 `奖项` varchar(100) ,
 `积分` int(11) 
)*/;

/*Table structure for table `a1小学“七彩风车小屋”拼装彩绘个人赛` */

DROP TABLE IF EXISTS `a1小学“七彩风车小屋”拼装彩绘个人赛`;

/*!50001 DROP VIEW IF EXISTS `a1小学“七彩风车小屋”拼装彩绘个人赛` */;
/*!50001 DROP TABLE IF EXISTS `a1小学“七彩风车小屋”拼装彩绘个人赛` */;

/*!50001 CREATE TABLE  `a1小学“七彩风车小屋”拼装彩绘个人赛`(
 `id` int(11) ,
 `参赛队` varchar(100) ,
 `姓名` varchar(100) ,
 `编号` varchar(20) ,
 `原始成绩` text ,
 `成绩备注` text ,
 `成绩排序` varchar(255) ,
 `排名` varchar(100) ,
 `奖项` varchar(100) ,
 `积分` int(11) 
)*/;

/*Table structure for table `a2中学“缤纷童年”场景规划制作团体赛` */

DROP TABLE IF EXISTS `a2中学“缤纷童年”场景规划制作团体赛`;

/*!50001 DROP VIEW IF EXISTS `a2中学“缤纷童年”场景规划制作团体赛` */;
/*!50001 DROP TABLE IF EXISTS `a2中学“缤纷童年”场景规划制作团体赛` */;

/*!50001 CREATE TABLE  `a2中学“缤纷童年”场景规划制作团体赛`(
 `id` int(11) ,
 `参赛队` varchar(100) ,
 `姓名` varchar(100) ,
 `编号` varchar(20) ,
 `原始成绩` text ,
 `成绩备注` text ,
 `成绩排序` varchar(255) ,
 `排名` varchar(100) ,
 `奖项` varchar(100) ,
 `积分` int(11) 
)*/;

/*Table structure for table `a2小学“缤纷童年”场景规划制作团体赛` */

DROP TABLE IF EXISTS `a2小学“缤纷童年”场景规划制作团体赛`;

/*!50001 DROP VIEW IF EXISTS `a2小学“缤纷童年”场景规划制作团体赛` */;
/*!50001 DROP TABLE IF EXISTS `a2小学“缤纷童年”场景规划制作团体赛` */;

/*!50001 CREATE TABLE  `a2小学“缤纷童年”场景规划制作团体赛`(
 `id` int(11) ,
 `参赛队` varchar(100) ,
 `姓名` varchar(100) ,
 `编号` varchar(20) ,
 `原始成绩` text ,
 `成绩备注` text ,
 `成绩排序` varchar(255) ,
 `排名` varchar(100) ,
 `奖项` varchar(100) ,
 `积分` int(11) 
)*/;

/*Table structure for table `b1中学“天戈”遥控直升机障碍赛` */

DROP TABLE IF EXISTS `b1中学“天戈”遥控直升机障碍赛`;

/*!50001 DROP VIEW IF EXISTS `b1中学“天戈”遥控直升机障碍赛` */;
/*!50001 DROP TABLE IF EXISTS `b1中学“天戈”遥控直升机障碍赛` */;

/*!50001 CREATE TABLE  `b1中学“天戈”遥控直升机障碍赛`(
 `id` int(11) ,
 `参赛队` varchar(100) ,
 `姓名` varchar(100) ,
 `编号` varchar(20) ,
 `原始成绩` text ,
 `成绩备注` text ,
 `成绩排序` varchar(255) ,
 `排名` varchar(100) ,
 `奖项` varchar(100) ,
 `积分` int(11) 
)*/;

/*Table structure for table `b1小学“天戈”遥控直升机障碍赛` */

DROP TABLE IF EXISTS `b1小学“天戈”遥控直升机障碍赛`;

/*!50001 DROP VIEW IF EXISTS `b1小学“天戈”遥控直升机障碍赛` */;
/*!50001 DROP TABLE IF EXISTS `b1小学“天戈”遥控直升机障碍赛` */;

/*!50001 CREATE TABLE  `b1小学“天戈”遥控直升机障碍赛`(
 `id` int(11) ,
 `参赛队` varchar(100) ,
 `姓名` varchar(100) ,
 `编号` varchar(20) ,
 `原始成绩` text ,
 `成绩备注` text ,
 `成绩排序` varchar(255) ,
 `排名` varchar(100) ,
 `奖项` varchar(100) ,
 `积分` int(11) 
)*/;

/*Table structure for table `c1中学环保时装秀` */

DROP TABLE IF EXISTS `c1中学环保时装秀`;

/*!50001 DROP VIEW IF EXISTS `c1中学环保时装秀` */;
/*!50001 DROP TABLE IF EXISTS `c1中学环保时装秀` */;

/*!50001 CREATE TABLE  `c1中学环保时装秀`(
 `id` int(11) ,
 `参赛队` varchar(100) ,
 `姓名` varchar(100) ,
 `编号` varchar(20) ,
 `原始成绩` text ,
 `成绩备注` text ,
 `成绩排序` varchar(255) ,
 `排名` varchar(100) ,
 `奖项` varchar(100) ,
 `积分` int(11) 
)*/;

/*Table structure for table `c1小学环保时装秀` */

DROP TABLE IF EXISTS `c1小学环保时装秀`;

/*!50001 DROP VIEW IF EXISTS `c1小学环保时装秀` */;
/*!50001 DROP TABLE IF EXISTS `c1小学环保时装秀` */;

/*!50001 CREATE TABLE  `c1小学环保时装秀`(
 `id` int(11) ,
 `参赛队` varchar(100) ,
 `姓名` varchar(100) ,
 `编号` varchar(20) ,
 `原始成绩` text ,
 `成绩备注` text ,
 `成绩排序` varchar(255) ,
 `排名` varchar(100) ,
 `奖项` varchar(100) ,
 `积分` int(11) 
)*/;

/*Table structure for table `c2中学环保创意制作` */

DROP TABLE IF EXISTS `c2中学环保创意制作`;

/*!50001 DROP VIEW IF EXISTS `c2中学环保创意制作` */;
/*!50001 DROP TABLE IF EXISTS `c2中学环保创意制作` */;

/*!50001 CREATE TABLE  `c2中学环保创意制作`(
 `id` int(11) ,
 `参赛队` varchar(100) ,
 `姓名` varchar(100) ,
 `编号` varchar(20) ,
 `原始成绩` text ,
 `成绩备注` text ,
 `成绩排序` varchar(255) ,
 `排名` varchar(100) ,
 `奖项` varchar(100) ,
 `积分` int(11) 
)*/;

/*Table structure for table `c2小学环保创意制作` */

DROP TABLE IF EXISTS `c2小学环保创意制作`;

/*!50001 DROP VIEW IF EXISTS `c2小学环保创意制作` */;
/*!50001 DROP TABLE IF EXISTS `c2小学环保创意制作` */;

/*!50001 CREATE TABLE  `c2小学环保创意制作`(
 `id` int(11) ,
 `参赛队` varchar(100) ,
 `姓名` varchar(100) ,
 `编号` varchar(20) ,
 `原始成绩` text ,
 `成绩备注` text ,
 `成绩排序` varchar(255) ,
 `排名` varchar(100) ,
 `奖项` varchar(100) ,
 `积分` int(11) 
)*/;

/*View structure for view a1中学“七彩风车小屋”拼装彩绘个人赛 */

/*!50001 DROP TABLE IF EXISTS `a1中学“七彩风车小屋”拼装彩绘个人赛` */;
/*!50001 DROP VIEW IF EXISTS `a1中学“七彩风车小屋”拼装彩绘个人赛` */;

/*!50001 CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `a1中学“七彩风车小屋”拼装彩绘个人赛` AS select `users`.`id` AS `id`,`users`.`参赛队` AS `参赛队`,`users`.`姓名` AS `姓名`,`users`.`编号` AS `编号`,`users`.`原始成绩` AS `原始成绩`,`users`.`成绩备注` AS `成绩备注`,`users`.`成绩排序` AS `成绩排序`,`users`.`排名` AS `排名`,`users`.`奖项` AS `奖项`,`users`.`积分` AS `积分` from `users` where ((`users`.`项目` = '“七彩风车小屋”拼装彩绘个人赛') and (`users`.`组别` = '中学')) order by if((`users`.`排名` = ''),1,0),abs(`users`.`排名`),`users`.`编号` */;

/*View structure for view a1小学“七彩风车小屋”拼装彩绘个人赛 */

/*!50001 DROP TABLE IF EXISTS `a1小学“七彩风车小屋”拼装彩绘个人赛` */;
/*!50001 DROP VIEW IF EXISTS `a1小学“七彩风车小屋”拼装彩绘个人赛` */;

/*!50001 CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `a1小学“七彩风车小屋”拼装彩绘个人赛` AS select `users`.`id` AS `id`,`users`.`参赛队` AS `参赛队`,`users`.`姓名` AS `姓名`,`users`.`编号` AS `编号`,`users`.`原始成绩` AS `原始成绩`,`users`.`成绩备注` AS `成绩备注`,`users`.`成绩排序` AS `成绩排序`,`users`.`排名` AS `排名`,`users`.`奖项` AS `奖项`,`users`.`积分` AS `积分` from `users` where ((`users`.`项目` = '“七彩风车小屋”拼装彩绘个人赛') and (`users`.`组别` = '小学')) order by if((`users`.`排名` = ''),1,0),abs(`users`.`排名`),`users`.`编号` */;

/*View structure for view a2中学“缤纷童年”场景规划制作团体赛 */

/*!50001 DROP TABLE IF EXISTS `a2中学“缤纷童年”场景规划制作团体赛` */;
/*!50001 DROP VIEW IF EXISTS `a2中学“缤纷童年”场景规划制作团体赛` */;

/*!50001 CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `a2中学“缤纷童年”场景规划制作团体赛` AS select `users`.`id` AS `id`,`users`.`参赛队` AS `参赛队`,`users`.`姓名` AS `姓名`,`users`.`编号` AS `编号`,`users`.`原始成绩` AS `原始成绩`,`users`.`成绩备注` AS `成绩备注`,`users`.`成绩排序` AS `成绩排序`,`users`.`排名` AS `排名`,`users`.`奖项` AS `奖项`,`users`.`积分` AS `积分` from `users` where ((`users`.`项目` = '“缤纷童年”场景规划制作团体赛') and (`users`.`组别` = '中学')) order by if((`users`.`排名` = ''),1,0),abs(`users`.`排名`),`users`.`编号` */;

/*View structure for view a2小学“缤纷童年”场景规划制作团体赛 */

/*!50001 DROP TABLE IF EXISTS `a2小学“缤纷童年”场景规划制作团体赛` */;
/*!50001 DROP VIEW IF EXISTS `a2小学“缤纷童年”场景规划制作团体赛` */;

/*!50001 CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `a2小学“缤纷童年”场景规划制作团体赛` AS select `users`.`id` AS `id`,`users`.`参赛队` AS `参赛队`,`users`.`姓名` AS `姓名`,`users`.`编号` AS `编号`,`users`.`原始成绩` AS `原始成绩`,`users`.`成绩备注` AS `成绩备注`,`users`.`成绩排序` AS `成绩排序`,`users`.`排名` AS `排名`,`users`.`奖项` AS `奖项`,`users`.`积分` AS `积分` from `users` where ((`users`.`项目` = '“缤纷童年”场景规划制作团体赛') and (`users`.`组别` = '小学')) order by if((`users`.`排名` = ''),1,0),abs(`users`.`排名`),`users`.`编号` */;

/*View structure for view b1中学“天戈”遥控直升机障碍赛 */

/*!50001 DROP TABLE IF EXISTS `b1中学“天戈”遥控直升机障碍赛` */;
/*!50001 DROP VIEW IF EXISTS `b1中学“天戈”遥控直升机障碍赛` */;

/*!50001 CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `b1中学“天戈”遥控直升机障碍赛` AS select `users`.`id` AS `id`,`users`.`参赛队` AS `参赛队`,`users`.`姓名` AS `姓名`,`users`.`编号` AS `编号`,`users`.`原始成绩` AS `原始成绩`,`users`.`成绩备注` AS `成绩备注`,`users`.`成绩排序` AS `成绩排序`,`users`.`排名` AS `排名`,`users`.`奖项` AS `奖项`,`users`.`积分` AS `积分` from `users` where ((`users`.`项目` = '“天戈”遥控直升机障碍赛') and (`users`.`组别` = '中学')) order by if((`users`.`排名` = ''),1,0),abs(`users`.`排名`),`users`.`编号` */;

/*View structure for view b1小学“天戈”遥控直升机障碍赛 */

/*!50001 DROP TABLE IF EXISTS `b1小学“天戈”遥控直升机障碍赛` */;
/*!50001 DROP VIEW IF EXISTS `b1小学“天戈”遥控直升机障碍赛` */;

/*!50001 CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `b1小学“天戈”遥控直升机障碍赛` AS select `users`.`id` AS `id`,`users`.`参赛队` AS `参赛队`,`users`.`姓名` AS `姓名`,`users`.`编号` AS `编号`,`users`.`原始成绩` AS `原始成绩`,`users`.`成绩备注` AS `成绩备注`,`users`.`成绩排序` AS `成绩排序`,`users`.`排名` AS `排名`,`users`.`奖项` AS `奖项`,`users`.`积分` AS `积分` from `users` where ((`users`.`项目` = '“天戈”遥控直升机障碍赛') and (`users`.`组别` = '小学')) order by if((`users`.`排名` = ''),1,0),abs(`users`.`排名`),`users`.`编号` */;

/*View structure for view c1中学环保时装秀 */

/*!50001 DROP TABLE IF EXISTS `c1中学环保时装秀` */;
/*!50001 DROP VIEW IF EXISTS `c1中学环保时装秀` */;

/*!50001 CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `c1中学环保时装秀` AS select `users`.`id` AS `id`,`users`.`参赛队` AS `参赛队`,`users`.`姓名` AS `姓名`,`users`.`编号` AS `编号`,`users`.`原始成绩` AS `原始成绩`,`users`.`成绩备注` AS `成绩备注`,`users`.`成绩排序` AS `成绩排序`,`users`.`排名` AS `排名`,`users`.`奖项` AS `奖项`,`users`.`积分` AS `积分` from `users` where ((`users`.`项目` = '环保时装秀') and (`users`.`组别` = '中学')) order by if((`users`.`排名` = ''),1,0),abs(`users`.`排名`),`users`.`编号` */;

/*View structure for view c1小学环保时装秀 */

/*!50001 DROP TABLE IF EXISTS `c1小学环保时装秀` */;
/*!50001 DROP VIEW IF EXISTS `c1小学环保时装秀` */;

/*!50001 CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `c1小学环保时装秀` AS select `users`.`id` AS `id`,`users`.`参赛队` AS `参赛队`,`users`.`姓名` AS `姓名`,`users`.`编号` AS `编号`,`users`.`原始成绩` AS `原始成绩`,`users`.`成绩备注` AS `成绩备注`,`users`.`成绩排序` AS `成绩排序`,`users`.`排名` AS `排名`,`users`.`奖项` AS `奖项`,`users`.`积分` AS `积分` from `users` where ((`users`.`项目` = '环保时装秀') and (`users`.`组别` = '小学')) order by if((`users`.`排名` = ''),1,0),abs(`users`.`排名`),`users`.`编号` */;

/*View structure for view c2中学环保创意制作 */

/*!50001 DROP TABLE IF EXISTS `c2中学环保创意制作` */;
/*!50001 DROP VIEW IF EXISTS `c2中学环保创意制作` */;

/*!50001 CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `c2中学环保创意制作` AS select `users`.`id` AS `id`,`users`.`参赛队` AS `参赛队`,`users`.`姓名` AS `姓名`,`users`.`编号` AS `编号`,`users`.`原始成绩` AS `原始成绩`,`users`.`成绩备注` AS `成绩备注`,`users`.`成绩排序` AS `成绩排序`,`users`.`排名` AS `排名`,`users`.`奖项` AS `奖项`,`users`.`积分` AS `积分` from `users` where ((`users`.`项目` = '环保创意制作') and (`users`.`组别` = '中学')) order by if((`users`.`排名` = ''),1,0),abs(`users`.`排名`),`users`.`编号` */;

/*View structure for view c2小学环保创意制作 */

/*!50001 DROP TABLE IF EXISTS `c2小学环保创意制作` */;
/*!50001 DROP VIEW IF EXISTS `c2小学环保创意制作` */;

/*!50001 CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `c2小学环保创意制作` AS select `users`.`id` AS `id`,`users`.`参赛队` AS `参赛队`,`users`.`姓名` AS `姓名`,`users`.`编号` AS `编号`,`users`.`原始成绩` AS `原始成绩`,`users`.`成绩备注` AS `成绩备注`,`users`.`成绩排序` AS `成绩排序`,`users`.`排名` AS `排名`,`users`.`奖项` AS `奖项`,`users`.`积分` AS `积分` from `users` where ((`users`.`项目` = '环保创意制作') and (`users`.`组别` = '小学')) order by if((`users`.`排名` = ''),1,0),abs(`users`.`排名`),`users`.`编号` */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
